R-intro/R-intro-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-26 火 21:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>確率統計2022 初心者用 R 言語講座演習ノート</title>
<meta name="author" content="suzuki@iwate-u.ac.jp" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">確率統計2022 初心者用 R 言語講座演習ノート</h1>
<div class="org-src-container">
<pre class="src src-R">
</pre>
</div>
<p>
<a href="http://chianti.ucsd.edu/~rsaito/ENTRY1/WEB_RS3/PDF/JPN/Texts/R_Stats2.pdf">初心者用 - R_Stats2.pdf</a>
</p>

<div id="outline-container-org7a14226" class="outline-2">
<h2 id="org7a14226">4. 簡単なベクトル演算</h2>
<div class="outline-text-2" id="text-org7a14226">
<div class="org-src-container">
<pre class="src src-R">
 (x <span style="color: #e5786d;">&lt;-</span> c(2,4,6,8,10))    <span style="color: #99968b;"># </span><span style="color: #99968b;">&#12505;&#12463;&#12488;&#12523;&#12398;&#20316;&#25104;</span>
 length(x)               <span style="color: #99968b;"># </span><span style="color: #99968b;">&#12505;&#12463;&#12488;&#12523;&#12398;&#27425;&#20803;&#25968;&#12289;&#12377;&#12394;&#12431;&#12385;&#12505;&#12463;&#12488;&#12523;&#20013;&#12398;&#25968;&#20516;&#12398;&#20491;&#25968;</span>
 x[3]                    <span style="color: #99968b;"># </span><span style="color: #99968b;">3 &#30058;&#30446;&#12398;&#25968;&#20516;&#12434;&#25277;&#20986;&#12377;&#12427;</span>
 x[c(2,4)]               <span style="color: #99968b;"># </span><span style="color: #99968b;">2&#30058;&#30446;&#12392; 4 &#30058;&#30446;&#12398;&#25968;&#20516;&#12434;&#25277;&#20986;</span>
 x[2:4]                  <span style="color: #99968b;"># </span><span style="color: #99968b;">2 &#30058;&#30446;&#12363;&#12425; 4 &#30058;&#30446;&#12414;&#12391;&#12398;&#25968;&#20516;&#12434;&#25277;&#20986;</span>

</pre>
</div>

<pre class="example">
[1]  2  4  6  8 10
[1] 5
[1] 6
[1] 4 8
[1] 4 6 8
</pre>
</div>


<div id="outline-container-org893727e" class="outline-3">
<h3 id="org893727e">ベクトルの比較演算</h3>
<div class="outline-text-3" id="text-org893727e">
<div class="org-src-container">
<pre class="src src-R">
x
x &gt; 5                    <span style="color: #99968b;"># </span><span style="color: #99968b;">&#12505;&#12463;&#12488;&#12523;&#12398;&#21508;&#35201;&#32032;&#12364; 5 &#12424;&#12426;&#22823;&#12365;&#12356;&#12363;&#12398;&#21028;&#23450;</span>
which (x&gt;5)
2
x[which(x&gt;5)]
x[x&gt;5]
</pre>
</div>

<pre class="example">
[1]  2  4  6  8 10
[1] FALSE FALSE  TRUE  TRUE  TRUE
[1] 3 4 5
[1]  6  8 10
[1]  6  8 10
</pre>


<ul class="org-ul">
<li>判定した結果が TRUE, FALSE のベクトルとして返ってきます。</li>
<li>which を使うと、何番目が T なのかが返ってきます。</li>
</ul>
</div>
</div>

<div id="outline-container-orgee61d8d" class="outline-3">
<h3 id="orgee61d8d">文字列のベクトル</h3>
<div class="outline-text-3" id="text-orgee61d8d">
<div class="org-src-container">
<pre class="src src-R">
x <span style="color: #e5786d;">&lt;-</span> c(<span style="color: #95e454;">"Sunday"</span>, <span style="color: #95e454;">"Monday"</span>, <span style="color: #95e454;">"Tuesday"</span>, <span style="color: #95e454;">"Wednesday"</span>, <span style="color: #95e454;">"Thursday"</span>, <span style="color: #95e454;">"Friday"</span>, <span style="color: #95e454;">"Saturday"</span>)

x[c(2,4)]
x[2:4]
grep(<span style="color: #95e454;">"sd"</span>, x)  <span style="color: #99968b;"># </span><span style="color: #99968b;">"sd"&#12434;&#21547;&#12416;&#35201;&#32032;&#12434;&#25506;&#12377;</span>

</pre>
</div>

<pre class="example">
[1] "Monday"    "Wednesday"
[1] "Monday"    "Tuesday"   "Wednesday"
[1] 3 4 5
</pre>
</div>
</div>

<div id="outline-container-orgad51693" class="outline-3">
<h3 id="orgad51693">ベクトルの各要素の名前付け</h3>
<div class="outline-text-3" id="text-orgad51693">
<div class="org-src-container">
<pre class="src src-R">x <span style="color: #e5786d;">&lt;-</span> c(2, 4, 6)
names(x) <span style="color: #e5786d;">&lt;-</span> c(<span style="color: #95e454;">"First"</span>, <span style="color: #95e454;">"Second"</span>, <span style="color: #95e454;">"Third"</span>)
x[[<span style="color: #95e454;">"Second"</span>]]

</pre>
</div>

<p>
x の names という <b>属性</b> に (“First”, “Second”, “Third”) が
付けられる。
</p>
</div>
</div>

<div id="outline-container-orga4ee893" class="outline-3">
<h3 id="orga4ee893">数値ベクトルに対する様々な統計関数</h3>
<div class="outline-text-3" id="text-orga4ee893">
<div class="org-src-container">
<pre class="src src-R">

sum(x)     <span style="color: #99968b;"># </span><span style="color: #99968b;">x &#12398;&#21512;&#35336;&#12289;</span>
mean(x)    <span style="color: #99968b;"># </span><span style="color: #99968b;">x &#12398;&#24179;&#22343;</span>
(x <span style="color: #e5786d;">&lt;-</span> c(2,4,6,8,10));
sum(x &gt; 5) <span style="color: #99968b;"># </span><span style="color: #99968b;">x &#12398;&#20013;&#12398;TRUE&#12398;&#25968;&#12434;&#25968;&#12360;&#12427;</span>
</pre>
</div>

<pre class="example">
[1] 30
[1] 6
[1]  2  4  6  8 10
[1] 3
</pre>
</div>
</div>

<div id="outline-container-org93b727c" class="outline-3">
<h3 id="org93b727c">課題 4-1:</h3>
<div class="outline-text-3" id="text-org93b727c">
<p>
ベクトル(3, 1, 4, 1, 5, 9, 2, 6, 5)の中で 5 より大きい要素からなるベクトルを作成 しましょう。
</p>

<div class="org-src-container">
<pre class="src src-R">

</pre>
</div>
</div>
</div>


<div id="outline-container-org9249f36" class="outline-3">
<h3 id="org9249f36">課題 4-2:</h3>
<div class="outline-text-3" id="text-org9249f36">
<p>
ベクトル(1,2,3,4,5,6,7,8,9,10,11,12)に(“Jan”, “Feb”, “Mar”,
“Apr”, “May”, “Jun”, “Jul”, “Aug”, “Sep”, “Oct”,
“Nov”, “Dec”)という名前を付け、”Mar”という文字列を使って 3
番目の要素を取り出してみましょう。
</p>
</div>
</div>
</div>

<div id="outline-container-orgbcbbd4b" class="outline-2">
<h2 id="orgbcbbd4b">5. 簡単な行列の作成と演算</h2>
<div class="outline-text-2" id="text-orgbcbbd4b">
<p>
ベクトルを集めて行列を作成する
</p>

<div class="org-src-container">
<pre class="src src-R">
(x <span style="color: #e5786d;">&lt;-</span> rbind(c(1,2,3), c(4,5,6)))
(x <span style="color: #e5786d;">&lt;-</span> matrix(c(1, 4, 2, 5, 3, 6), nrow=2, ncol=3)) <span style="color: #99968b;"># </span><span style="color: #99968b;">nrow:&#34892;&#25968;&#65292; ncol:&#21015;&#25968;</span>

</pre>
</div>

<pre class="example">
     [,1] [,2] [,3]
[1,]    1    2    3
[2,]    4    5    6
     [,1] [,2] [,3]
[1,]    1    2    3
[2,]    4    5    6
</pre>


<div class="org-src-container">
<pre class="src src-R">
x+1
x*2

y <span style="color: #e5786d;">&lt;-</span> rbind(c(2, 4, 6), c(8, 10, 12))

x + y 
x * y

x[2,3]
x[2,]
x[,3]
t(x) <span style="color: #99968b;"># </span><span style="color: #99968b;">&#36578;&#32622;</span>

</pre>
</div>

<pre class="example" id="org52c08e4">
	 [,1] [,2] [,3]
    [1,]    2    3    4
    [2,]    5    6    7
	 [,1] [,2] [,3]
    [1,]    2    4    6
    [2,]    8   10   12
	 [,1] [,2] [,3]
    [1,]    3    6    9
    [2,]   12   15   18
	 [,1] [,2] [,3]
    [1,]    2    8   18
    [2,]   32   50   72
    [1] 6
    [1] 4 5 6
    [1] 3 6
	 [,1] [,2]
    [1,]    1    4
    [2,]    2    5
    [3,]    3    6
</pre>

<div class="org-src-container">
<pre class="src src-R">
apply(x, 2, mean) <span style="color: #99968b;"># </span><span style="color: #99968b;">&#34892;&#21644;&#65292;x&#12398;2&#27425;&#20803;&#30446;&#12398;&#21508;&#38917;&#12398;&#24179;&#22343;</span>
apply(x, 1, mean) <span style="color: #99968b;"># </span><span style="color: #99968b;">&#21015;&#21644;&#65292;x&#12398;1&#27425;&#20803;&#30446;&#12398;&#21508;&#38917;&#12398;&#24179;&#22343;</span>

</pre>
</div>

<pre class="example">
[1] 2.5 3.5 4.5
[1] 2 5
</pre>



<p>
行列は 2 次元の数値の羅列ですが、
R では array(ベクトル、各次元の要素の個数)を使っ てさらに n 次元に拡張された配列を扱うことができます。
</p>

<div class="org-src-container">
<pre class="src src-R">
(x <span style="color: #e5786d;">&lt;-</span> array(1:24, c(3,4,2))) <span style="color: #99968b;"># </span><span style="color: #99968b;">3&#215;4&#215;2 &#12398;&#22823;&#12365;&#12373;&#12398;3&#27425;&#20803;&#37197;&#21015;&#12434;&#20316;&#25104;</span>


</pre>
</div>

<pre class="example" id="orgc6a806f">
    , , 1

	 [,1] [,2] [,3] [,4]
    [1,]    1    4    7   10
    [2,]    2    5    8   11
    [3,]    3    6    9   12

    , , 2

	 [,1] [,2] [,3] [,4]
    [1,]   13   16   19   22
    [2,]   14   17   20   23
    [3,]   15   18   21   24
</pre>

<p>
課題5-1: 
</p>

<p>
課題5-2: 上記結果に対して行、列それぞれの平均を求めましょう。 
</p>
</div>
</div>

<div id="outline-container-org2c36c1f" class="outline-2">
<h2 id="org2c36c1f">6. 簡単なリストの作成</h2>
<div class="outline-text-2" id="text-org2c36c1f">
<p>
リストは様々な型のデータをひとまとめにして管理できるデータ型です。
</p>

<div class="org-src-container">
<pre class="src src-R">
(x <span style="color: #e5786d;">&lt;-</span> list(<span style="color: #95e454;">"Oh"</span>, <span style="color: #95e454;">"Nomura"</span>, <span style="color: #95e454;">"Kadota"</span>))
(x <span style="color: #e5786d;">&lt;-</span> list(<span style="color: #95e454;">"Oh"</span>, <span style="color: #95e454;">"Nomura"</span>, <span style="color: #95e454;">"Kadota"</span>, c(868, 657, 567)))

x[[2]]
x[[4]]

</pre>
</div>

<pre class="example" id="org9ffdd65">
    [[1]]
    [1] "Oh"

    [[2]]
    [1] "Nomura"

    [[3]]
    [1] "Kadota"
    [[1]]
    [1] "Oh"

    [[2]]
    [1] "Nomura"

    [[3]]
    [1] "Kadota"

    [[4]]
    [1] 868 657 567
    [1] "Nomura"
    [1] 868 657 567
</pre>


<p>
各々の要素に名前を付けることも可能です。
</p>
<div class="org-src-container">
<pre class="src src-R">
(x <span style="color: #e5786d;">&lt;-</span> list(First=<span style="color: #95e454;">"Oh"</span>, Second=<span style="color: #95e454;">"Nomura"</span>, Third=<span style="color: #95e454;">"Kadota"</span>, Home_Runs=c(868, 657, 567)))

</pre>
</div>

<pre class="example" id="orgae331a4">
    $First
    [1] "Oh"

    $Second
    [1] "Nomura"

    $Third
    [1] "Kadota"

    $Home_Runs
    [1] 868 657 567
</pre>


<p>
として、各々の要素に First, Second, Third, Home_Runs という名前が
付いていることを確認しましょう。
</p>

<div class="org-src-container">
<pre class="src src-R">
x[[4]]
x$Home_Runs


</pre>
</div>

<pre class="example">
[1] 868 657 567
[1] 868 657 567
</pre>


<p>
課題 6-1: 名前が Yamagata のベクトル(“Tsuruoka”, “Sakata”,
     “Yonezawa”)と名前が Niigata のベクトル(“Yuzawa”, “Niitsu”,
     “Shibata”)を要素にしたようなリストを作成し、そ の中味を表示し
     てみましょう。8
</p>
</div>
</div>

<div id="outline-container-org14db2d7" class="outline-2">
<h2 id="org14db2d7">7. 簡単なデータフレームの作成</h2>
<div class="outline-text-2" id="text-org14db2d7">
<p>
R にはデータフレームと呼ばれる型が存在します。
</p>
<ul class="org-ul">
<li>リストの一種で、行列と同じ二次元配列です。</li>
</ul>

<p>
データフレームの各々の行は1つのサンプルに対する観測値、
各列はサン プルに対する1つの項目とみなすことができます。
これを使うと、表を簡単に表現するこ とができます。
以下の表は日本プロ野球の5人の元選手の名前、在籍チーム名、通算打数、 安打数、本塁打数を表したものです。
</p>

<p>
Home_Runs 2901 657 3085 504 2543 504 2786 868 2566 567
</p>

<div class="org-src-container">
<pre class="src src-R">
(x <span style="color: #e5786d;">&lt;-</span> data.frame(
 row.names = c(<span style="color: #95e454;">"Nomura"</span>, <span style="color: #95e454;">"Harimoto"</span>, <span style="color: #95e454;">"Kinugasa"</span>, <span style="color: #95e454;">"Oh"</span>, <span style="color: #95e454;">"Kadota"</span>),
 Team = c(<span style="color: #95e454;">"Hawks"</span>, <span style="color: #95e454;">"Flyers"</span>, <span style="color: #95e454;">"Carps"</span>, <span style="color: #95e454;">"Giants"</span>, <span style="color: #95e454;">"Hawks"</span>),
 At_Bat = c(10472, 9666, 9404, 9250, 8868),
 Hits = c(2901, 3085, 2543, 2786, 2566),
 Home_Runs = c(657, 504, 504, 868, 567)
))

</pre>
</div>

<pre class="example">
           Team At_Bat Hits Home_Runs
Nomura    Hawks  10472 2901       657
Harimoto Flyers   9666 3085       504
Kinugasa  Carps   9404 2543       504
Oh       Giants   9250 2786       868
Kadota    Hawks   8868 2566       567
</pre>



<div class="org-src-container">
<pre class="src src-R">
x$Hits
x[ c(1,5), c(2,3,4) ] <span style="color: #99968b;"># </span><span style="color: #99968b;">1&#12289;5 &#34892;&#30446;&#12392; 2&#12289;3&#12289;4 &#21015;&#30446;&#12434;&#25277;&#20986;&#12377;&#12427;</span>
</pre>
</div>

<pre class="example">
[1] 2901 3085 2543 2786 2566
       At_Bat Hits Home_Runs
Nomura  10472 2901       657
Kadota   8868 2566       567
</pre>


<div class="org-src-container">
<pre class="src src-R">
attributes(x)

</pre>
</div>

<pre class="example">
$names
[1] "Team"      "At_Bat"    "Hits"      "Home_Runs"

$class
[1] "data.frame"

$row.names
[1] "Nomura"   "Harimoto" "Kinugasa" "Oh"       "Kadota"
</pre>



<div class="org-src-container">
<pre class="src src-R">
names(x)
row.names(x)
class(x)

</pre>
</div>

<pre class="example">
[1] "Team"      "At_Bat"    "Hits"      "Home_Runs"
[1] "Nomura"   "Harimoto" "Kinugasa" "Oh"       "Kadota"
[1] "data.frame"
</pre>
</div>




<div id="outline-container-org4710fb7" class="outline-3">
<h3 id="org4710fb7">課題 7-1:</h3>
<div class="outline-text-3" id="text-org4710fb7">
<p>
下の表は G8 加盟国の国力の一部です。これをデータフレームとして変数にしま しょう5。
</p>

<div class="org-src-container">
<pre class="src src-R">(x <span style="color: #e5786d;">&lt;-</span> data.frame(
row.names = c(<span style="color: #95e454;">"USA"</span>, <span style="color: #95e454;">"England"</span>, <span style="color: #95e454;">"Italy"</span>, <span style="color: #95e454;">"Canada"</span>, <span style="color: #95e454;">"Germany"</span>, <span style="color: #95e454;">"Japan"</span>, <span style="color: #95e454;">"France"</span>, <span style="color: #95e454;">"Russia"</span>), 
    Area = c(9.4, 0.2, 0.3, 10.0, 0.3, 0.3, 0.5, 17.1),
    Population = c(315, 62, 60, 34, 82, 127, 62, 141),
    GDP = c(14, 3, 2, 2, 4, 5, 3, 2)
))
</pre>
</div>

<pre class="example">
        Area Population GDP
USA      9.4        315  14
England  0.2         62   3
Italy    0.3         60   2
Canada  10.0         34   2
Germany  0.3         82   4
Japan    0.3        127   5
France   0.5         62   3
Russia  17.1        141   2
</pre>
</div>
</div>

<div id="outline-container-orgb67957c" class="outline-3">
<h3 id="orgb67957c">課題 7-2:</h3>
<div class="outline-text-3" id="text-orgb67957c">
<p>
上記で作成したデータフレームより G8 加盟国の国土面積、人口、GDP の
平均を それぞれ求めましょう。
</p>

<div class="org-src-container">
<pre class="src src-R">
x
mean(x$Area)
mean(x[[<span style="color: #95e454;">"Population"</span>]])
mean(x[,3])
c(<span style="color: #95e454;">"mean(x$Area) = "</span>, mean(x$Area))

</pre>
</div>

<pre class="example" id="org2b9ef20">
	    Area Population GDP
    USA      9.4        315  14
    England  0.2         62   3
    Italy    0.3         60   2
    Canada  10.0         34   2
    Germany  0.3         82   4
    Japan    0.3        127   5
    France   0.5         62   3
    Russia  17.1        141   2
    [1] 4.7625
    [1] 110.375
    [1] 4.375
    [1] "mean(x$Area) = " "4.7625"
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp</p>
<p class="date">Created: 2022-04-26 火 21:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
